MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx250f256h.h
#define _U3STA_FERR_POSITION                     0x00000002
#define _U3STA_FERR_MASK                         0x00000004
#define _U3STA_FERR_LENGTH                       0x00000001

#define _U3STA_PERR_POSITION                     0x00000003
#define _U3STA_PERR_MASK                         0x00000008
#define _U3STA_PERR_LENGTH                       0x00000001

#define _U3STA_RIDLE_POSITION                    0x00000004
#define _U3STA_RIDLE_MASK                        0x00000010
#define _U3STA_RIDLE_LENGTH                      0x00000001

#define _U3STA_ADDEN_POSITION                    0x00000005
#define _U3STA_ADDEN_MASK                        0x00000020
#define _U3STA_ADDEN_LENGTH                      0x00000001

#define _U3STA_URXISEL_POSITION                  0x00000006
#define _U3STA_URXISEL_MASK                      0x000000C0
#define _U3STA_URXISEL_LENGTH                    0x00000002

#define _U3STA_TRMT_POSITION                     0x00000008
#define _U3STA_TRMT_MASK                         0x00000100
#define _U3STA_TRMT_LENGTH                       0x00000001

#define _U3STA_UTXBF_POSITION                    0x00000009
#define _U3STA_UTXBF_MASK                        0x00000200
#define _U3STA_UTXBF_LENGTH                      0x00000001

#define _U3STA_UTXEN_POSITION                    0x0000000A
#define _U3STA_UTXEN_MASK                        0x00000400
#define _U3STA_UTXEN_LENGTH                      0x00000001

#define _U3STA_UTXBRK_POSITION                   0x0000000B
#define _U3STA_UTXBRK_MASK                       0x00000800
#define _U3STA_UTXBRK_LENGTH                     0x00000001

#define _U3STA_URXEN_POSITION                    0x0000000C
#define _U3STA_URXEN_MASK                        0x00001000
#define _U3STA_URXEN_LENGTH                      0x00000001

#define _U3STA_UTXINV_POSITION                   0x0000000D
#define _U3STA_UTXINV_MASK                       0x00002000
#define _U3STA_UTXINV_LENGTH                     0x00000001

#define _U3STA_UTXISEL_POSITION                  0x0000000E
#define _U3STA_UTXISEL_MASK                      0x0000C000
#define _U3STA_UTXISEL_LENGTH                    0x00000002

#define _U3STA_ADDR_POSITION                     0x00000010
#define _U3STA_ADDR_MASK                         0x00FF0000
#define _U3STA_ADDR_LENGTH                       0x00000008

#define _U3STA_ADM_EN_POSITION                   0x00000018
#define _U3STA_ADM_EN_MASK                       0x01000000
#define _U3STA_ADM_EN_LENGTH                     0x00000001

#define _U3STA_URXISEL0_POSITION                 0x00000006
#define _U3STA_URXISEL0_MASK                     0x00000040
#define _U3STA_URXISEL0_LENGTH                   0x00000001

#define _U3STA_URXISEL1_POSITION                 0x00000007
#define _U3STA_URXISEL1_MASK                     0x00000080
#define _U3STA_URXISEL1_LENGTH                   0x00000001

#define _U3STA_UTXISEL0_POSITION                 0x0000000E
#define _U3STA_UTXISEL0_MASK                     0x00004000
#define _U3STA_UTXISEL0_LENGTH                   0x00000001

#define _U3STA_UTXISEL1_POSITION                 0x0000000F
#define _U3STA_UTXISEL1_MASK                     0x00008000
#define _U3STA_UTXISEL1_LENGTH                   0x00000001

#define _U3STA_UTXSEL_POSITION                   0x0000000E
#define _U3STA_UTXSEL_MASK                       0x0000C000
#define _U3STA_UTXSEL_LENGTH                     0x00000002

#define _U3STA_w_POSITION                        0x00000000
#define _U3STA_w_MASK                            0xFFFFFFFF
#define _U3STA_w_LENGTH                          0x00000020

#define _U5aSTA_URXDA_POSITION                   0x00000000
#define _U5aSTA_URXDA_MASK                       0x00000001
#define _U5aSTA_URXDA_LENGTH                     0x00000001

#define _U5aSTA_OERR_POSITION                    0x00000001
#define _U5aSTA_OERR_MASK                        0x00000002
#define _U5aSTA_OERR_LENGTH                      0x00000001

#define _U5aSTA_FERR_POSITION                    0x00000002
#define _U5aSTA_FERR_MASK                        0x00000004
#define _U5aSTA_FERR_LENGTH                      0x00000001

#define _U5aSTA_PERR_POSITION                    0x00000003
#define _U5aSTA_PERR_MASK                        0x00000008
#define _U5aSTA_PERR_LENGTH                      0x00000001

#define _U5aSTA_RIDLE_POSITION                   0x00000004
#define _U5aSTA_RIDLE_MASK                       0x00000010
#define _U5aSTA_RIDLE_LENGTH                     0x00000001

#define _U5aSTA_ADDEN_POSITION                   0x00000005
#define _U5aSTA_ADDEN_MASK                       0x00000020
#define _U5aSTA_ADDEN_LENGTH                     0x00000001

#define _U5aSTA_URXISEL_POSITION                 0x00000006
#define _U5aSTA_URXISEL_MASK                     0x000000C0
#define _U5aSTA_URXISEL_LENGTH                   0x00000002

#define _U5aSTA_TRMT_POSITION                    0x00000008
#define _U5aSTA_TRMT_MASK                        0x00000100
#define _U5aSTA_TRMT_LENGTH                      0x00000001

#define _U5aSTA_UTXBF_POSITION                   0x00000009
#define _U5aSTA_UTXBF_MASK                       0x00000200
#define _U5aSTA_UTXBF_LENGTH                     0x00000001

#define _U5aSTA_UTXEN_POSITION                   0x0000000A
#define _U5aSTA_UTXEN_MASK                       0x00000400
#define _U5aSTA_UTXEN_LENGTH                     0x00000001

#define _U5aSTA_UTXBRK_POSITION                  0x0000000B
#define _U5aSTA_UTXBRK_MASK                      0x00000800
#define _U5aSTA_UTXBRK_LENGTH                    0x00000001

#define _U5aSTA_URXEN_POSITION                   0x0000000C
#define _U5aSTA_URXEN_MASK                       0x00001000
#define _U5aSTA_URXEN_LENGTH                     0x00000001

#define _U5aSTA_UTXINV_POSITION                  0x0000000D
#define _U5aSTA_UTXINV_MASK                      0x00002000
#define _U5aSTA_UTXINV_LENGTH                    0x00000001

#define _U5aSTA_UTXISEL_POSITION                 0x0000000E
#define _U5aSTA_UTXISEL_MASK                     0x0000C000
#define _U5aSTA_UTXISEL_LENGTH                   0x00000002

#define _U5aSTA_ADDR_POSITION                    0x00000010
#define _U5aSTA_ADDR_MASK                        0x00FF0000
#define _U5aSTA_ADDR_LENGTH                      0x00000008

#define _U5aSTA_ADM_EN_POSITION                  0x00000018
#define _U5aSTA_ADM_EN_MASK                      0x01000000
#define _U5aSTA_ADM_EN_LENGTH                    0x00000001

